In [1]:
# Setup
from env import get_db_url
import pandas as pd

In [3]:
# 3.
url = get_db_url('employees')

In [4]:
# 5. 
emp_sql_df = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)
# and errors

In [5]:
# 6.
emp_sql_df

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [7]:
titles_sql_df = pd.read_sql('SELECT * FROM titles', url)
titles_sql_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [25]:
# 7. Yes, what i expected
print(emp_sql_db.shape)
print(titles_sql_df.shape)

(5, 6)
(5, 4)

In [43]:
# 8.
print('Employees')
print(emp_sql_df.describe())
print('-------------------\nTitles DB')
print(titles_sql_df.describe())

Employees
             emp_no
count      5.000000
mean   10053.000000
std        1.581139
min    10051.000000
25%    10052.000000
50%    10053.000000
75%    10054.000000
max    10055.000000
-------------------
Titles DB
            emp_no
count      5.00000
mean   10037.20000
std        0.83666
min    10036.00000
25%    10037.00000
50%    10037.00000
75%    10038.00000
max    10038.00000

In [57]:
# 9. 
print(titles_sql_df.title.unique().size)

7

In [17]:
# 10.
titles_sql_df.sort_values('to_date').head(1)

       emp_no     title   from_date     to_date
16064   20869  Engineer  1985-02-17  1985-03-01

In [16]:
titles_sql_df.sort_values('to_date', ascending=False)

        emp_no               title   from_date     to_date
0        10001     Senior Engineer  1986-06-26  9999-01-01
251516  270060  Assistant Engineer  1997-12-24  9999-01-01
251529  270070        Senior Staff  1994-12-30  9999-01-01
251528  270069     Senior Engineer  2001-03-31  9999-01-01
251526  270068            Engineer  1999-04-09  9999-01-01
...        ...                 ...         ...         ...
277603  287732               Staff  1985-04-14  1985-04-17
35527    34059     Senior Engineer  1985-02-10  1985-03-23
346216  434232               Staff  1985-02-26  1985-03-20
406358  474918            Engineer  1985-02-10  1985-03-11
16064    20869            Engineer  1985-02-17  1985-03-01

[443308 rows x 4 columns]